#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd

In [6]:
ser=pd.Series([4,8,15,16,23,42])
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
lst=[1,2,3,4,'a','b','c',5,6,7,8]
ser1=pd.Series(lst)
print(ser1)

0     1
1     2
2     3
3     4
4     a
5     b
6     c
7     5
8     6
9     7
10    8
dtype: object

In [8]:
#### Q3. Create a Pandas DataFrame that contains the following data:

In [10]:
data={
    "Name":["Alice","bob","claire"],
    "Age":[25,30,27],
    "Gender":["Female","male","Female"]
}
data=pd.DataFrame(data)
data.head()

     Name  Age  Gender
0   Alice   25  Female
1     bob   30    male
2  claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
- dataframe is two diamensioanl data sturture
- it can be mutuable

In [13]:
### dataframe => data get it from Q3
type(data)

pandas.core.frame.DataFrame

In [14]:
data['Name']

0     Alice
1       bob
2    claire
Name: Name, dtype: object

In [15]:
type(data['Name'])

pandas.core.series.Series

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head()
- To get the fist five records of the dataframe

Tail()
- to get last five records of the dataframe

columns
- to retrive the column name in dataframe

In [ ]:
data.head()

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
- dataframe and panle is mutable type

In [23]:
#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [24]:
name=["mari","prakas","ranji"]
age=[26,29,27]

In [26]:
data1=pd.DataFrame({"Name":name,"Age":age})
data1

     Name  Age
0    mari   26
1  prakas   29
2   ranji   27